Repository: t3ac/t3up
Catalog: Resources/Private/Language/*.locallang_constants.xlf
Languages: de

# container
source: Max-width of the containers (default 1440px)
de: Hauptcontainer, maximale Breite: der Css max-width-Wert des Boostrap-Hauptcontainers (Vorgabe: 1440px)

# mediaslide
source: Sliding of the col "media"
de: Media-Sliding: dies aktiviert das Vererben des "Media"-Bereiches, der Kopfbereich einiger Layouts auf die darunterliegenden Seiten. Zum Beispiel ein Kopf-/Headerbild, oder ein Slider im Kopfbereich.

# access
source: Show the access-links
de: Schnelle Zugriffe: diese Links sind nur über die Tab-Tastatur erreichbar, definiert als Liste im TypoScript lib.access

# mobil
source: Mobilstyles: 0 - none, 1 - meanmenu , 2 - mmenu, 3 - simplemenu
de: Mobile Navigation: 0 - es wird keine mobil Navigation aktiviert, 1 - Meanmenu, schlankes, sich von ober nach unten aufklappendes Menü, 2 - jQuery-Mmenu, sich verschiebendes, mehrstufiges jQuery-Menü, 3 - Simple menu, sehr einfaches jQuery-Menü

# totopfunction
source: Including the totop-function
de: Zum Seitenanfang-Funktion: inkludiert das TypoScript und JavaScript, hat zusätzlich noch ein eigenes Scss. Die Farben werden im Bereich T3UP: COLORS definert.

# printbutton
source: If it's true, shows a print-button
de: Zeigt einen Printbutton. TypoScript unter Configuration/TypoScript/Content/

# breadcrumbwrap
source: Css-classes for the breadcrumb
de: CSS-Klasse für das Breadcrumb Menü

# bootstrapdesign
source: Designs for the booststrap elements e.g. accordions
de: Zusätzliche Boostrap Designs

# bootstrapaccordion
source: Designs for the booststrap accordions
de: Boostrap Akkordeon Designs

# bootstraptabs
source: Designs for the booststrap tabs
de: Boostrap Tabulatoren Designs

# bootstrapslider
source: Designs for the booststrap slider
de: Boostrap Slider Designs

source: Basecolors
de: Basis Farbeinstellungen

source: Basecolor
de: Basisfarbe: Grundfarbe, für Links, Hintergründe etc.

# baseTextColor
source: Basecolor of the content-text
de: Text-Basisfarbe: Standardwert für den Text (Vorgabe #333)

# baseLinkColor
source: Basecolor of the links in the content
de: Basisfarbe für Links: (Vorgabe #333)

# baseLinkHoverColor
source: Basecolor of the links hover in the content
de: Hoverfarbe, für Links: (Vorgabe #000)

# bodyBgColor
source: Background-color
de: Hintergrundfarbe: Farbe des Hintergrunds (keine Vorgabe)

# baseContainerBgColor
source: Background-color main container
de: Haupt-Containerfarbe: Hintergrundfarbe des Inhaltcontainers (keine Vorgabe)

# shadow
source: The box-shadow basic value
de: Schatten: Vordefinierter Wert für den Schatten bei u.a. Inhaltselementen

# pictureoverlayfunction
source: Switch the overlay for images on/off (default off)
de: Schaltet das Overlay für Bilder an/aus (Vorgabe aus)

# pictureoverlay
source: The overlaycolor for images (default rgb 65 65 65, 0.15)
de: Farben des Overlays bei verlinkten Bildern

# pictureoverlaytext
source: The overlaytextcolor - alttext - for images (default rgb 0 0 0, 1)
de: Textfarbe - Alttext - des Overlays bei verlinkten Bildern

# pictureoverlaytextsize
source: The overlaytextcolor - alttext - size (1rem)
de: Schriftgröße für den Alttext - des Overlays bei verlinkten Bildern

# header
source: Colors in the Header-/Toparea
de: Farben des Kopfbereiches

# headerBgColor
source: Header - background color (default transparent)
de: Hintergrundfarbe des Kopfbereiches: keine Vorgabe

# headerColor
source: Header - text color (default inherit)
de: Textfarbe des Kopfbereiches: keine Vorgabe / Standardfarbe

# headerLinkColor
source: Header - link color (default inherit)
de: Linkfarbe des Kopfbereiches: keine Vorgabe / Standardfarbe

# headerLinkHoverColor
source: Header - hover color (default inherit)
de: Hover der Linkfarbe des Kopfbereiches: keine Vorgabe / Standardfarbe

# topBgColor
source: Top-area - background color (default transparent)
de: Hintergrundfarbe des Top-Bereiches: keine Vorgabe

# topBgColorTrans
source: Top-area - background color translucency from 0.0 - 1 (default 1)
de: Transparenz der Hintergrundfarbe des Top-Bereiches.: Nur Werte von 0.00 - 1.00 sind erlaubt. Vorgabe 1

# topLinkColor
source: Linkcolor in the top-area 1)
de: Linkfarbe für den Topbereich

# topLinkHoverColor
source: Hover linkcolor in the top-area 1)
de: Hover-Linkfarbe für den Topbereich

# headercolor
source: Header colors
de: Farben der Überschriften

# h1-color
source: H1 color (default inherit)
de: Farbe der H1-Überschrift

# h2-color
source: H2 color (default inherit)
de: Farbe der H2-Überschrift

# h3-color
source: H3 color (default inherit)
de: Farbe der H3-Überschrift

# h4-color
source: H4 color (default inherit)
de: Farbe der H4-Überschrift

# navigationcolor
source: Navigation Colors
de: Farben der Navigation

# navLinkColor
source: Linkcolor in first level (default #333)
de: Linkfarbe der ersten Navigationsebene (Vorgabe #333)

# navLinkHoverColor
source: Hover-Linkcolor in first level (default #000)
de: Hover der Linkfarbe der ersten Navigationsebene (Vorgabe #000)

# subnavLinkColor
source: Linkcolor in the next levels (default #333)
de: Linkfarbe der Unternavigation (Vorgabe #333)

# subnavLinkHoverColor
source: Hover-Linkcolor in the next levels (default #000)
de: Hover der Linkfarbe der Unternavigation (Vorgabe #000)

# subNavBG
source: backgroundcolor of the subnavigation-area
de: Hintergrund der Unternaviagtionsebene (Vorgabe rgba(255,255,255,.98))

# subnavigationLinkColor
source: Linkcolor in the subnavigation (default #333)
de: Linkfarbe der seitlichen Navigation (Vorgabe #333)

# subnavigationLinkHoverColor
source: Hover-Linkcolor in the subnavigation default #000)
de: Hover der Linkfarbe der seitlichen Navigation (Vorgabe #000)

# navBorderBottomColor
source: Color for the line under a navpoint
de: Farbe der Linie unter der Navigation in der höchsten Ebene (Vorgabe rgba(100,100,100,1))

# overlay
source: backgroundcolor of the overlay (default rgba(0, 0, 0, 0.5))
de: Hintergrundfarbe des Overlays (Vorgabe (rgba(0, 0, 0, 0.5))

# footer
source: Colors in the Footerarea
de: Farben im Footerbereich

# footer1BGColor
source: Footer - backgroundcolor
de: Hintergrundfarbe des Footerbereichs: keine Vorgabe

# footer1TextColor
source: Footer - text color
de: Textfarbe des Footerbereichs: keine Vorgabe / Standardfarbe

# footer1LinkColor
source: Footer - link color
de: Linkfarbe des Footerbereichs: keine Vorgabe / Standardfarbe

# footer1LinkHoverColor
source: Footer - hover color
de: Hover der Linkfarbe des Footerbereichs: keine Vorgabe / Standardfarbe

# footer3BGColor
source: Footerbase - background color
de: Hintergrundfarbe der Abschlusszeile: keine Vorgabe

# footer3TextColor
source: Footerbase - text color
de: Textfarbe der Abschlusszeile: keine Vorgabe / Standardfarbe

# footer3LinkColor
source: Footerbase - link color
de: Linkfarbe der Abschlusszeile: keine Vorgabe / Standardfarbe

# footer3LinkHoverColor
source: Footerbase - hover color
de: Hover der Linkfarbe der Abschlusszeile: keine Vorgabe / Standardfarbe

# totop
source: Colors of the totop-function
de: Farben der totop-Funktion

# totopBgColor
source: Totop backgroundcolor
de: Hintergrundfarbe zum Seitenanfang: keine Vorgabe / Standardfarbe

source: Totop - link color
de: Linkfarbe zum Seitenanfang: keine Vorgabe / Standardfarbe

# navLinkHoverBGColor
source: Hover-Backgroundcolor in first level (default rgba(255,255,1))
de: Hover der Hintergrundfarbe der ersten Navigationsebene (Vorgabe rgba(255,255,1))

# totopLinkHoverColor
source: Totop - hover color
de: Hover der Linkfarbe zum Seitenanfang: keine Vorgabe / Standardfarbe

# totopPosBottom
source: Totop - bottom-position
de: Bottom-Position des ToTop-Links

# totopPosRight
source: Totop - right-position
de: Right-Position des ToTop-Links

# pagecolor
source: Pagecolors
de: Seitenfarben: diese sind als Seiteneigenschaften auf jeder Seite verfügbar. Es muss in der "LocalConfiguration.php" im Bereich "FE" 'addRootLineFields' => 'basecolor,' eingetragen sein. Diese Farbauswahl überstimmt dann den Farbwert für Basecolor.

# blue
source: Pagecolor for navigation and mark up: blue
de: Farbwert für die Farbe: Blau

# green
source: Pagecolor for navigation and mark up: green
de: Farbwert für die Farbe: Grün

# grey
source: Pagecolor for navigation and mark up: grey
de: Farbwert für die Farbe: Grau

# orange
source: Pagecolor for navigation and mark up: orange
de: Farbwert für die Farbe: Orange

# red
source: Pagecolor for navigation and mark up: red
de: Farbwert für die Farbe: Rot

# turquoise
source: Pagecolor for navigation and mark up: turquoise
de: Farbwert für die Farbe: Türkis

# violett
source: Pagecolor for navigation and mark up: violett
de: Farbwert für die Farbe: Violett

# yellow
source: Pagecolor for navigation and mark up: yellow
de: Farbwert für die Farbe: Gelb

# darkblue
source: Pagecolor for navigation and mark up: darkblue
de: Farbwert für die Farbe: Dunkelblau

# darkgrey
source: Pagecolor for navigation and mark up: darkgrey
de: Farbwert für die Farbe: Dunkelgrau

# bootstrap
source: Bootstrap Basiccolors
de: Boostrap Farbwerte

# bootstrapcolor.danger
source: Bootstrapcolor danger color
de: Farbwert Danger

# bootstrapcolor.warning
source: Bootstrapcolor warning color
de: Farbwert Warning

# bootstrapcolor.success
source: Bootstrapcolor success color
de: Farbwert Success

# bootstrapcolor.primary
source: Bootstrapcolor primary color
de: Farbwert Primary

# bootstrapcolor.secondary
source: Bootstrapcolor secondary color
de: Farbwert Secondary

# bootstrapcolor.info
source: Bootstrapcolor info color
de: Farbwert Info

# bootstrapcolor.light
source: Bootstrapcolor light color
de: Farbwert Light

# bootstrapcolor.dark
source: Bootstrapcolor dark color
de: Farbwert Dark

# bootstrapcolor.link
source: Bootstrapcolor link color
de: Farbwert Link

# tableConstants
source: Table basiccolors
de: Basisfarben für Tabellen

# tableHeader
source: Background of a table-header (th)
de: Hintergrund der Kopfzeile

# tableHeaderColor
source: Textcolor of a table-header (th)
de: Textfarbe Kopfzeile

# tableHeaderLineColor
source: Bordercolor of a table-header (th)
de: Linienfarbe der Kopfzeile

# tableLineColor
source: Bordercolor of a table-cell (td)
de: Linienfarbe der Zellen

# contentElement
source: Fluid-Style-Content Templates
de: Fluid-Style-Content Templates: Geänderte Templates von FSC

# contentElement.layoutpath
source: The layoutpath for the extend Fluid-Style-Content
de: Layoutpath: Fluid-Style-Content Layout-Pfad

# contentElement.partialpath
source: The partialpath for the extend Fluid-Style-Content
de: Partialpath: Fluid-Style-Content Partial-Pfad

# contentElement.templatepath
source: The templatepath for the extend Fluid-Style-Content
de: Templatepath: Fluid-Style-Content Template-Pfad

source: Fluid-Templates
de: Fluidtemplates: Die Templates für die Seitenausgabe: In der Extension-Configuration müssen die gewünschten Templates aktiviert werden!

# fluidtemplates.layoutpath
source: The layoutpath for the Templates
de: Layoutpath: Fluidtemplates Layout-Pfad

# fluidtemplates.partialpath
source: The partialpath for the Templates
de: Partialspath: Fluidtemplates Template-Pfad

# fluidtemplates.templatepath
source: The templatepath for the Templates
de: Templatepath: Fluidtemplates Template-Pfad

# javascript
source: JavaScripts
de: Javascript-Dateien

# jquery
source: Include jquery 3.6 (default on, recommended)
de: Javascript jquery 3.6: empfohlen und aktiviert

# basic
source: Including the Basic JavaScript (default on, recommended)
de: Javascript jQuery-Basis: kleine Helfer, empfohlen und aktiviert

# modernizer
source: Including the Modernizer JavaScript (default on, recommended)
de: Javascript Modernizer: Ersetzungsscripte, für ältere Browser, empfohlen und aktiviert

# subnavigation
source: Including the Subnavigation JavaScript
de: Javascript Subnavigation: jQuery-Scripte für die T3UP-Subnavigationen

# bootstrapCarouselscript
source: Including the JavaScript bootstrap Carousel
de: Javascript für Boostrap Carousel

# logintemplate
source: The template for the Ajax-Login
de: Template für das Ajax-Login

# symbol
source: The Symbol fontface
de: Symbolschrift: FontAwesome, für FontAwesome Pro muss eine Lizens erworben werden.

# symbol2
source: The Symbol fontface scss file
de: Symbolschrift Scss-Datei: FontAwesome

# font
source: Primary font-face, [Open-Sans, PT-Sans, Roboto, Source-Sans-Pro, Ubuntu, Arial, Verdana] are as a complete set possible
de: Sass-Variable $font. Schriften [Open-Sans, PT-Sans, Roboto, Source-Sans-Pro, Ubuntu, Arial, Verdana]: zur Zeit sind diese Schriften intergriert. Sie befinden sich alle unterhalb des Verzeichnisse fontpath. Ordnername = Schriftname!

# font2
source: Secondary font-face, [Courier, AltasTypewriter, Times] are as a complete set possible
de: Sass-Variable $font2. Zweite Schrift [Courier, AltasTypewriter, Times, Merriweather]: zur Zeit sind diese Schriften intergriert. Sie befinden sich alle unterhalb des Verzeichnisse fontpath. Ordnername = Schriftname!

# fontpath
source: Path of the font-files: default 'typo3conf/ext/t3up/Resources/Public/Fonts/'
de: Schriftpfad 1. Schrift: Alle Schriften befinden sich unterhalb des Pfades 'typo3conf/ext/t3up/Resources/Public/Fonts/'. Um eine andere Schrift einzubinden, muss diesem Paket, oder dem angebenen Pfad integriert werden. Verzeichnis muss entsprechend der Schrift lauten. Bitte dazu die vorhandenen Sass-Dateien unter Resources/Public/Sass/Fonts/ für die Schriften anschauen.

# fontdef
source: Path of the font-definitions (default: typo3conf/ext/t3up/Resources/Public/Sass/), in your own definition maybe: Cms/Resources/Public/Sass/
de: Pfad, in dem sich die scss-Datei befindet, in der die Schriftdefinitionen befinden, Ursprung ist: typo3conf/ext/t3up/Resources/Public/Sass/ darunter befindet sich dann ein Ordner Fonts und darunter die Schriftdatei.scc, die immer so heißen muss, wie die Schrift selber, auch mit Leerzeichen.

# font2path
source: Path of the font-files: default 'typo3conf/ext/t3up/Resources/Public/Fonts/'
de: Schriftpfad 2. Schrift: Alle Schriften befinden sich unterhalb des Pfades 'typo3conf/ext/t3up/Resources/Public/Fonts/'. Um eine andere Schrift einzubinden, muss diesem Paket, oder dem angebenen Pfad integriert werden. Verzeichnis muss entsprechend der Schrift lauten. Bitte dazu die vorhandenen Sass-Dateien unter Resources/Public/Sass/Fonts/ für die Schriften anschauen.

# font2def
source: Path of the font-definitions (default: typo3conf/ext/t3up/Resources/Public/Sass/), in your own definition maybe: Cms/Resources/Public/Sass/
de: Pfad, in dem sich die scss-Datei befindet, in der die Schriftdefinitionen befinden, Ursprung ist: typo3conf/ext/t3up/Resources/Public/Sass/ darunter befindet sich dann ein Ordner Fonts und darunter die Schriftdatei.scc, die immer so heißen muss, wie die Schrift selber, auch mit Leerzeichen.

# bg1
source: Informationarea and wraps in the Footer
de: Informationen und Wraps im Footerbereich

# address
source: ID of the postaladdress
de: Adresse: Content-ID des Elements mit der Anschrift etc.

# addressWrap
source: Address css-wrap
de: Der CSS-Wrap um die Adresse

# service1
source: ID of the Content-Element Service 1
de: Service 1: Content-ID des Elements, das im Footer als Service 1 ausgegeben werden soll.

# service1Wrap
source: Service1 css-wrap
de: Der CSS-Wrap um Service1

# service2
source: ID of the Content-Element Service 2
de: Service 2: Content-ID des Elements, das im Footer als Service 2 ausgegeben werden soll.

# service2Wrap
source: Service2 css-wrap
de: Der CSS-Wrap um Service2

# service3
source: ID of the Content-Element Service 3
de: Service 3: Content-ID des Elements, das im Footer als Service 3 ausgegeben werden soll. Alternativ kann auch die ID des Bereiches mit den Quicklinks eingegeben werden.

# service3Wrap
source: Service3 css-wrap
de: Der CSS-Wrap um Service3

# footer1Wrap
source: Footer1 css-wrap
de: Der CSS-Wrap um die Inhalte in Footer1

# bg2
source: Links and wraps in the footerline
de: Links und wraps in der Abschlußzeile

# base
source: Show the basearea in the footer
de: Abschlußzeile: Aktiviert die unterste Ebene im Footer

# link
source: Link Adress for the copyright
de: Copyrightlink: Linkadresse des Copyrights

# contactpage
source: Page-ID with the address
de: Adresse: Seiten-ID mit der Adresse

# dataprotection
source: Page with the data protection informations
de: Datenschutz: Seiten-ID mit den Informationen zum Datenschutz

# disabilityaccess
source: Page with the disability access informations
de: Barrierefreiheit: Seiten-ID mit den Informationen zur Barrierefreiheit

source: Impress
de: Impressum: Seiten-ID mit dem Impressum

# lastchange
source: Show lastchange
de: Zeigt das Datum der letzten Aktualisierung

# pid
source: Show the PID
de: Zeigt die aktuelle Seiten-ID

# owner
source: Show the owner of the page, only locked in
de: Zeigt den Besitzer der Seite (nur für aktivierte User)

# footerBaseWrap
source: Footerbase css-wrap
de: Der CSS-Wrap um die Inhalte in der Abschlußzeile

# logos
source: Logos in the Header
de: Logo im Headerbereich

# logo
source: Location of the logo-file (recommended SVG), with leading "/".
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/".

# logo.1
source: Location of the english logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Englisch

# logo.2
source: Location of the french logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Französisch

# logo.3
source: Location of the italian logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Italienisch

# logo.4
source: Location of the polish logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Polnisch

# logo.5
source: Location of the turkey logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Türkisch

# logo.6
source: Location of the spanish logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Spanisch

# logo.7
source: Location of the portuguese logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Portugiesisch

# logo.8
source: Location of the romanian logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Romanian

# logo.9
source: Location of the chinese logo-file
de: Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/". Chinesisch

# alttext
source: Alttext for the Logo in the header
de: Alttext des Logos

# moillogo
source: Shows a small logo in the toparea for mobil devices.
de: Mobillogo-Datei mit Pfad: Logo, dass in der Mobilen Version angezeigt werden kann, (empfohlen SVG), mit folgendem "/".

# logomaxwidth
source: Max. width of the logo in the headerarea
de: Logo Breite: Maximale Breite des Logos im Headerbereich

# logostickymaxwidth
source: Max. width of the logo in the headerarea (compressed)
de: Logo Breite: Maximale Breite des Logos im Headerbereich wenn Header dynamisch verkleinert ist. (dynheader muss aktiv sein)

# smalllogomaxheight
source: Max. height of the logo in the headerarea - dynheader is activated
de: Logo Höhe: Maximale Höhe des Logos in Pixel im Headerbereich wenn Dynheader aktiv ist.

# logowrap
source: Div wrap for the Logo
de: Div wrap um das Logo

# notlogowrap
source: Wrap of the part after the logo. Default "d-flex col-10 flex-wrap vertical-align-stretch"
de: Div wrap um den Bereich nach dem Logo, nur bei page.navigation.topposition = 0

# mobillogowrap
source: Div wrap for the mobillogo
de: Div wrap um das Mobillogo

# logoII
source: Location of the second logo-file (recommended SVG), with leading "/".
de: 2. Logo-Datei mit Pfad: (empfohlen SVG), mit folgendem "/".

# alttextII
source: Alttext of the 2. logo in the header
de: Alttext des 2. Logos

# linklogoII
source: Link of the 2. logo
de: Linkadresse des 2. Logos

# logoIImaxwidth
source: Max. width of the 2. logo in the headerarea
de: 2. Logo Breite: Maximale Breite des Logos im Headerbereich

# logoIIwrap
source: Div wrap of the 2. logo
de: Div wrap um das 2.Logo

# logins
source: Loginhandling
de: Loginverhalten

# loginpage
source: Shows the button. ID of the loginpage
de: Loginpage-Button: ID der Seite mit dem Login-Anmeldefeld. Nichts eingeben, wenn 'Loginbutton-Ajax' aktiv ist

# loginbutton
source: Shows the loginform (modal). Important, fill the feuser-constants!
de: Loginbutton: Zeigt eine Eingabeformular auf jeder Seite nach einem Klick. Die Felder im Bereich 'Feuser' müssen befüllt sein. Nichts eingeben, wenn 'Loginpage_Button' aktiv ist.

# logoutform
source: ID of content-element with logout-form.
de: Logout-Button: ID der Seite mit dem Logoutfeld

# homes
source: Homebutton and target
de: Home-Button Einstellung

# home
source: ID of the page "Home" for the home-button and the logo
de: Seiten-ID der Rootseite.

# homebutton
source: If it's true, shows the home-button in the top-area
de: Home-Button: Zeigt einen klickbaren Schalter im Headerbereich. 'page.header.home' darf nicht leer sein.

source: Functions
de: Weitere Einstellungen

# searchbutton
source: Shows the indexedsearch form (modal).
de: IndexedSearch-Button-Ajax: öffnet via Ajax auf jeder Seite nach einem Klick das Eingabefeld. 'Indexedsearchpage-Button' darf keinen Wert haben.

# searchpage
source: ID of the page with the indexedsearch form, shows a button in the top-area
de: Indexedsearchpage-Button: Seiten-ID der Seite mit dem indexedsearch-Plugin. 'IndexedSearch-Button-Ajax' darf keinen Wert haben.

# solrbutton
source: Shows the solrsearch form (modal).
de: Solrbutton-Ajax: öffnet via Ajax auf jeder Seite nach einem Klick das Eingabefeld. 'Solrpage-Button' darf keinen Wert haben.

# solrpage
source: ID of the page with the solrsearch form, shows a button in the top-area
de: Solrpage-Button: Seiten-ID der Seite mit dem Solr-Plugin. 'Solrbutton-Ajax' darf keinen Wert haben.

# languagemenu
source: Show the languagemenu
de: Sprachmenü aktivieren.

# quicklinks
source: ID of the content element with the "quicklinks", empty = no quicklinks in the header
de: Quicklinks: ID des Inhaltselements für den Schnellzugriff im Header. Ist ein einfaches Textelement als Liste.

source: Support
de: Unterstützung

# contrast
source: If it's true, shows a button for the contrast-version
de: Contrast: aktiviert wird ein CSS nachgeladen, mit Linkauszeichung, Schwarzweiß-Dartsellung etc.

# fontsize
source: If it's true, shows the range for the Fontsize. Disable dynheader!
de: Fontsize: aktiviert ein Script, mit dem dynamnisch die Schriftgröße verändert werden kann. 'dynheader' sollte dektiviert sein.

# darkmode
source: Available: Standard, Dark mode and Light.
de: Hell-/Dunkelmodus und Standard

# dynheader
source: Dynamic header-height by mouse-scrolling, has a own javascript.
de: Dynheader: erlaubt es den den Header-Bereich via Sass und JavaScript beim Scrollen immer anzuzeigen. 'topposition' unter Navigation darf nicht aktiviert sein.

# showtitle
source: If it's true, shows the title with the icons in the toparea
de: Showtitle: zeigt die Titel der Schalter neben dem jeweiligen Icon. Z.B. Menu, oder Login.

# navstyle
source: Navigationstyles: 0 - None, 1 - Standard, 2 - with media, 3 - Block, 4 - First Level + Anker Navigation, 5 - only Anker Navigation, 6 - No menu
de: Navigationstile: 0, keinen. 1, zeigt das Hauptmenü bis in die vierte Ebene. 2, zeigt das Hauptmenü ebenfalls bis in die vierte Ebene. Das Menü selber ist in einen Block eingebettet und dem jeweiligen Knoten kann unter Seite/Seiteneigenschaften ein Kapitelbild zugeordnet werden. 3, zeigt das Hauptmenü als Block bis in die dritte Ebene. 4 - zeigt ein einfaches Menü, mit 1. Ebene. 5, es werden nur die Anker dieser Seite angezeigt. 6, nur Header ohne Menü.
