Repository: t3ac/t3up
Catalog: Resources/Private/Language/*.locallang_backend.xlf
Languages: de

# colpos0
source: Content
de: Inhaltsbereich

# colpos1
source: Left column
de: Linke Spalte

# colpos2
source: Right column
de: Rechte Spalte

# colpos3
source: Media
de: Media/Kopfbereich

source: OneColumn Layout
de: Einspalten Layout mit Media

# OneColumnInMediaLayout
source: OneColumn Layout, media inside the container
de: Einspalten Layout mit Media im Container

# OneColumnNoMediaLayout
source: OneColumn Layout, with out media
de: Einspalten Layout

# ThreeColumnLayout
source: Layout with three equal columns
de: Dreispalten Layout

# LeftNavigationLayout
source: Layout with left navigation
de: Layout mit linker Unternavigation

# LeftNavigationMarginalLayout
source: Layout with left navigation, and marginalcolumn
de: Layout mit linker Unternavigation und rechter Marginalspalte

# RightNavigationLayout
source: Layout with right navigation
de: Layout mit rechter Unternavigation

# RightNavigationInMediaLayout
source: Layout with right navigation, Media integrated
de: Layout mit rechter Unternavigation, Media integriert

# OneTwoColumnLayout
source: Big main column, right marginal
de: Große Hauptspalte, kleine rechte Marginalspalte

# RightMarginalLayout
source: Layout with right marginal (off/on)
de: Layout mit rechter Marginalspalte

# fullpage
source: Pagelayout without a container
de: Seitenlayout, 100% Breite, ohne Container-Einfassung

# showtitle
source: Don't show the title
de: Zeige Seitenüberschrift (H1) nicht

# deltitle
source: Delete the title (h1), for plugins eg. news
de: Lösche Seitenüberschrift (H1), für z.B. Einzelansicht von News

# breadcrumb
source: Hide the breadcrumb
de: Blende Breadcrumb-Menü aus

# hidenav
source: Hides the subnavigation
de: Blende Unternavigation auf dieser Seite aus

# nonav
source: This page has no link in the navigation
de: Diese Seite hat keinen Link in der Navigation.

# previousnext
source: Shows previous/next buttons
de: Vor-/Zurück-Button unterhalb des Inhalts

# paddingBeforeClass
source: Padding Before
de: Innenabstand davor

# paddingAfterClass
source: Padding After
de: Innenabstand danach

# padding_class
source: Inner Padding
de: Innenabstand

# padding_class_none
source: none
de: Standard

# padding_class_5
source: extra-small
de: sehr klein

# padding_class_10
source: small
de: Klein

# padding_class_15
source: normal
de: Standard

# padding_class_20
source: normalplus
de: Größer

# padding_class_30
source: double
de: Doppelt

# padding_class_45
source: trippe
de: Dreifach

# padding_class_60
source: four-fold
de: vierfach

# padding_class_75
source: five-fold
de: fünffach

# padding_class_90
source: six-fold
de: sechsfach

# basecolor
source: Pagecolor
de: Seiten-Hauptfarbe

# basecolor-no
source: No Color
de: keine

# basecolor-blue
source: Blue
de: Blau

# basecolor-red
source: Red
de: Rot

# basecolor-green
source: Green
de: Grün

# basecolor-yellow
source: Yellow
de: Gelb

# basecolor-grey
source: Grey
de: Grau

# basecolor-turquoise
source: Turquoise
de: Türkis

# basecolor-darkblue
source: Dark blue
de: Dunkelblau

# basecolor-darkgrey
source: Dark grey
de: Dunkelgrau

# white
source: White background
de: Weißer Hintergrund

# colored
source: Colored background
de: Farbiger Hintergrund

# line
source: With a line
de: Mit Linie

# thin
source: Thin line
de: Dünne Linie

# medium
source: Medium line
de: Mitteldicke Linie

# thick
source: Thick line
de: Dicke Linie

# containerhandle
source: Handle as a container
de: Verhält sich wie ein Container
