Repository: t3ac/t3up
Catalog: Resources/Private/Language/*.locallang_constants.xlf
Languages: de

# navigation
source: Including the Navigation JavaScript. navigation1 - First level with content (default navigation1, recommended)
de: Wichtige Javascript Navigation: Sammlung der jQuery-Scripte für alle T3UP-Navigationstypen. navigation - Seite der obersten Ebene ohne Inhalt, nur klickbar, navigation1 - Seite der obersten Ebene mit Inhalt (Vorgabe)

# entryLevel
source: Entrylevel of the main-menu
de: Einstiegsebene des Hauptmenüs (Vorgabe = 0).

# maxitems
source: Max. Items for each navigation-level (default 10, max. 40)
de: Navigationunterpunkte: maximale Anzahl der Menüunterpunkte einer Seite, Vorgabe ist 10, maximal 100.

# navwrap
source: Wrap of the navigation margin-top/margin-bottom
de: Ummantelung der oberen Navigation, besonders margin-top/margin-bottom: Bootstap Klassen vorgegeben

# subnav
source: Entrylevel for the submenu (default 2)
de: Einstiegsebene: Einstieg ab rootlevel für die Unternavigation (Vorgabe ist 2).

# navplus
source: First level navigation with/without dropdown.
de: Erste Navigationsebene mit oder ohne Dropdown: mit dropmenue werden neben den Navigationspunkten in der obersten Ebene klickbare Symbole zum auf- und zuklappen aktiviert. Die Zeichen sind in »page.navigation.chars« unten auswählbar.

# maxlevels
source: Max. levels for the navigation (1-10)
de: Navigationsebenen: Anzahl der Ebenen im Baum. Wirkt sich auch auf die Navigationsanzeige in den Menüs aus. (1-10)

# navdir
source: Direction of the navigation
de: Navigationsrichtung: Ausrichtung der Navigation, (Standard ist links, zentriert und rechts ist möglich).

# logopos
source: Logo position: 1 - Left inside, 2 - Right inside, 3 - Top left, 4 - Top right
de: Logoposition: Das Logo kann innerhalb des Headers links 1 oder rechts 2 sitzen, dann ist die Symbolleiste oberhalb aktiv (topposition = active), oder die Symbolleiste ist im Header integriert, dann ebenfalls links 3 oder rechts 4.

# topposition
source: Position of the top area in the header. Active means absolute on the top.
de: Top-Area: Im Bereich Header ist die Position der Leiste mit Schaltern für Suche, Login etc. frei zu wählen, entweder als eigene Top-Zeile, oder innerhalb des Headerbereichs, dann werden die Standardfarbwerte für den Hintergrund eliminiert.

# topwrap
source: Wrap around the top-area.
de: Ummantelung des Topbereichs: 1 - container d-flex justify-content-start = links ausgerichtet, 2 - container d-flex justify-content-end = rechts ausgerichtet, 3 - container d-flex justify-content-center = zentriert ausgerichtet, 4 - container d-flex justify-content-between = gespreizt ausgerichtet, 5 - container d-flex justify-content-around = mit gleichen Abständen

# leveltitle
source: Shows the leveltitle on top of the subnavigation.
de: Zeigt den Level-Titel oberhalb der Navigation

# sideAnker
source: Shows ankers as a listpoint-navigation.
de: Zeigt die Anker einer Seite als Listenpunkte. Sonderform einer Seitennavigation mit jQuery.

# navcolor
source: Shows the pagecolors in the mainmenue.
de: Zeigt farbige Menüpunkte in der Hauptnavigation, abhängig von den Seiteneigenschaften.: Die Seiteneigenschaft »pagecolor« wird weitervererbt, also eine Seite die basecolor rot hat, hat z.B. rote h1-Überschriften, die Kinderseiten ebenfalls.

# breadcrumbstyle
source: Breadcrumb style, 1 - standard, 2 - extended.
de: Breadcrumb Stil, 0 - ohne, keine Breadcrumbleiste, 1 - Standard, 2 - erweitert, dann wird ein +-Symbol sichtbar und die benachbarten Seiten können direkt aufgerufen werden.

# breadcrumbulwrap
source: Wrap around the breacrumb: px-0 py-2 align-items-center list-unstyled navbar-nav me-auto
de: Breadcrumb-Wrap. Standard: px-0 py-2 align-items-center list-unstyled navbar-nav me-auto

# chars
source: Include a small js with the variables for the navigtion.
de: Kleines js beinhaltet die Zeichen für die Navigation, z.B. + und -, bzw. Pfeile.

# subnavlevel
source: Entrylevel for the submenu (default = 2)
de: Einstiegsebene der Unternavigation, Voreinstellung Ebene 2.

# scssmain
source: Basic Scss (default active, recommended)
de: Basis Scss-Datei (aktiviert, empfohlen)

# scssaccess
source: Including the scsss for the metanavigation (default active, recommended)
de: Metanavigation (aktiviert, empfohlen)

# scsstable
source: Including the scss for tables (default active, recommended)
de: Tabellen (aktiviert, empfohlen)

# scsslinks
source: Including the scss for the link-styles (default active, recommended)
de: Linkstile (aktiviert, empfohlen)

# scssfsc
source: Including the scss for the Fluid-Style-Content (default active, recommended)
de: Fluid-Style-Content (aktiviert, empfohlen)

# scssheader
source: Including the scss for the header-area (default active, recommended)
de: Headerbereich mit Top-Zeile (aktiviert, empfohlen)

# scsscontent
source: Including the scss for the content-area (default active, recommended)
de: Inhaltsbereich (aktiviert, empfohlen)

# scssfooter
source: Including the scss for the footer-area (default active, recommended)
de: Footerbereich (aktiviert, empfohlen)

# scssnavigation
source: Including the scsss for the navigation (default active, recommended)
de: Navigation (aktiviert, empfohlen) ältere Version: navigation1, auch bei SCSS eintragen!

# scssbreadcrumb
source: Including the scsss for the breadcrumb (default active, recommended)
de: Breadcrumb-Navigation (aktiviert)

# scsssubnavigation
source: Including the scsss for the subnavigation (default active, recommended)
de: Subnavigation (aktiviert)

# scssquicklinks
source: Including the scsss for the quicklinks (default active, recommended)
de: Quicklinks (aktiviert)

# scssbootstrapstyles
source: Including the scsss for the bootstrap styles (default active, recommended)
de: Boostrap-Stile für Akkordeons, Tabs einbinden(aktiviert)

# scsslightbox
source: Including the scss for lightbox-effects (recommended)
de: Lightbox Effekte Scss-Datei einbinden (empfohlen)

# socialmediaposition
source: Position of the Socialmediabuttons
de: Position des Socialmediabereichs

# facebook
source: Address of the facebook-website
de: Facebook-Adresse

# youtube
source: Address of the youtube-channel
de: Youtube Kanal

# twitter
source: Address of the twitter-channel
de: Twitter Kanal

# instagram
source: Address of the instagram-channel
de: Instagram Kanal

# email
source: E-Mail address
de: E-Mail Adresse

# xing
source: xing address
de: Xing Adresse

# linkedin
source: Linkedin address
de: Linkedin Adresse

# login
source: Loginpage
de: ID Seite Login

# location
source: Location/Contact
de: ID Standort/Kontakt

# search
source: Result of the search
de: Ergebnisseite der Suche

# hidelabel
source: Hide the labels
de: Labels ausblenden

# headers
source: Size, lineheight and weight for h1 - h4
de: Schriftgröße, Zeilenabstand und Schnitt der Überschriften H1 - H4

# bread
source: Size, lineheight and weight for p, li, td, th
de: Schriftgröße, Zeilensbstand und Schnitt der Tags p, li, td, th

# symbolfontsize
source: Fontsize for the symbols (Default 15px)
de: Schriftgröße der Symbole (Vorgabe 15px)

# navigationfontsize
source: Fontsize for the symbols (Default 1rem)
de: Schriftgröße der Hauptnavigation (Vorgabe 1rem)

# h1
source: Fontsize of the h1 headline
de: Schriftgröße der h1 Überschrift

# h1.md
source: Fontsize of the h1 headline, tablets
de: Schriftgröße der h1 Überschrift, Tablets

# h1.lg
source: Fontsize of the h1 headline, desktop
de: Schriftgröße der h1 Überschrift, Desktop

# h1.direction
source: Direction of the h1 headline
de: Textausrichtung der h1 Überschrift

# h2
source: Fontsize of the h2 headline
de: Schriftgröße der h2 Überschrift

# h2.md
source: Fontsize of the h2 headline, tablet
de: Schriftgröße der h2 Überschrift, Tablets

# h2.lg
source: Fontsize of the h2 headline, desktop
de: Schriftgröße der h2 Überschrift, Desktop

# h3
source: Fontsize of the h3 headline
de: Schriftgröße der h3 Überschrift

# h3.md
source: Fontsize of the h3 headline, tablet
de: Schriftgröße der h3 Überschrift, Tablets

# h3.lg
source: Fontsize of the h3 headline, desktop
de: Schriftgröße der h3 Überschrift, Desktop

# h4
source: Fontsize of the h4 headline
de: Schriftgröße der h4 Überschrift

# h4.md
source: Fontsize of the h4 headline, tablet
de: Schriftgröße der h4 Überschrift, Tablets

# h4.lg
source: Fontsize of the h4 headline, dektop
de: Schriftgröße der h4 Überschrift, Desktop

# h1.fontweight
source: Fontweight of the h1 headline (default 600)
de: Schriftschnitt der h1 Überschrift (Vorgabe 600)

# h2.fontweight
source: Fontweight of the h2 headline (default 600)
de: Schriftschnitt der h2 Überschrift (Vorgabe 600)

# h3.fontweight
source: Fontweight of the h3 headline (default 600)
de: Schriftschnitt der h3 Überschrift (Vorgabe 600)

# h4.fontweight
source: Fontweight of the h4 headline (default 600)
de: Schriftschnitt der h4 Überschrift (Vorgabe 600)

# boldweight
source: Fontweight b and strong html-tags (default 600)
de: Schriftschnitt für html-tags bold und strong (Vorgabe 600)

# h1.lineheight
source: Lineheight of the h1 headline (default 115%)
de: Zeilenhöhe der h1 Überschrift (Vorgabe 115%)

# h2.lineheight
source: Lineheight of the h2 headline (default 115%)
de: Zeilenhöhe der h2 Überschrift (Vorgabe 115%)

# h3.lineheight
source: Lineheight of the h3 headline (default 115%)
de: Zeilenhöhe der h3 Überschrift (Vorgabe 115%)

# h4.lineheight
source: Lineheight of the h4 headline (default 115%)
de: Zeilenhöhe der h4 Überschrift (Vorgabe 115%)

# p
source: Fontsize for p and li, (Default 1.05rem)
de: Schriftgröße für html-tags p und li (Vorgabe 1.05rem)

# p.md
source: Fontsize for p and li, tablet-size (default 1.10rem)
de: Schriftgröße für html-tags p und li - Tablets (Vorgabe 1.05rem)

# p.lg
source: Fontsize for p and li, desktop-size (default 1.15rem)
de: Schriftgröße für html-tags p und li - Desktop (Vorgabe 1.10rem)

# lineheight
source: lineheight/line spacing p-tag and li-tag (default 1.5rem)
de: Zeilenhöhe für html-tags p und li - Tablets (Vorgabe 1.5rem)

# h1.margin
source: Margin of the h1 headline (default 0 0 1rem)
de: Abstand der h1 Überschrift (Vorgabe 0 0 1rem)

# h1.padding
source: Padding left/right of the h1 headline (calc(var(--bs-gutter-x) / 1) !important)
de: Einrückung der h1 (calc(var(--bs-gutter-x) / 1) !important), weniger / 2

# h2.margin
source: Margin of the h2 headline (default 0 0 1rem)
de: Abstand der h2 Überschrift (Vorgabe 0 0 1rem)

# h3.margin
source: Margin of the h3 headline (default 0 0 1rem)
de: Abstand der h3 Überschrift (Vorgabe 0 0 1rem)

# h4.margin
source: Margin of the h4 headline (default 0 0 0)
de: Abstand der h4 Überschrift (Vorgabe 0 0 0)

# footers
source: Fontsize, fontweights in the footerarea
de: Schriftgröße und -schnitte für den Footerbereich

# footer1.h3
source: Fontsize of the h3 in footer1-area
de: Schriftgröße der h3 Überschrift im Footer

# footer1.fontsize
source: Fontsize in footer1-area
de: Schriftgröße im Footer(Vorgabe 1rem)

# footer1.fontweight
source: Fontweight of the links in the footer1-area
de: Schriftschnitt der Links im Footer (Vorgabe 600)

# footer1.lineheight
source: Lineheight in the footer1-area
de: Zeilenhöhe im Footer(Vorgabe 1.35rem)

# footer3.fontsize
source: Fontsize in footerbase-area
de: Schriftgröße in der Footer-Abschlußzeile (Vorgabe 1rem)

# footer3.fontweight
source: Fontweight in footerbase-area
de: Schriftschnitt in der Footer-Abschlußzeile (Vorgabe 600)
