Repository: t3ac/t3up
Catalog: Resources/Private/Language/*.quickedit.xlf
Languages: de

# usersettings.quickeditTab
source: Quickedit
de: Schnelles Editieren

# usersettings.disableQuickeditInPageModule
source: Quickedit toolbar in page module
de: Quickedit im Seitenmodul

# usersettings.quickeditDefaultHidden
source: Quickedit toolbar is hidden by default
de: Quickedit im Seitenmodul Standardmäßig ausgeblendet

# setting.disableToolbar
source: Disable Toolbar
de: Toolbar deaktiviert

# toggleButton
source: Show/Hide Quickedit toolbar
de: Zeige/verstecke Toolbar

# headerLabel
source: Quickedit
de: Labels

source: Current values
de: Aktuelle Werte

# defaultPageType.group.general
source: General
de: Allgemein

# defaultPageType.group.metadata
source: Metadata
de: Meta-Daten

# defaultPageType.group.access
source: Access
de: Zugriff

# defaultPageType.group.shortcut
source: Shortcut
de: Verweis
